/* 
Задача №. Ганов Александр Анатольевич
----------------------------------------------------
Описание задания:
~~~~~~~~~~~~~
а) Создать приложение, показанное на уроке, добавив в него защиту от возможных ошибок 
(не создана база данных, обращение к несуществующему вопросу, открытие слишком большого файла и т.д.).
б) Изменить интерфейс программы, увеличив шрифт, поменяв цвет элементов и добавив другие «косметические» 
    улучшения на свое усмотрение.
в) Добавить в приложение меню «О программе» с информацией о программе (автор, версия, авторские права и др.).
г)* Добавить пункт меню Save As, в котором можно выбрать имя для сохранения базы данных (элемент SaveFileDialog). */

using System;
using System.Windows.Forms;

namespace Lesson_08.Exp_05
{
    class Program
    {
        [STAThreadAttribute]
        static void Main(string[] args)
        {
            Application.EnableVisualStyles();
            BelieveOrNotBelieve initForm = new BelieveOrNotBelieve();
            Application.Run(initForm);
        }
    }
}
